#### DimReferenceCount Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Count"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId DimReferenceCount { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property DimReferenceCount As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ DimReferenceCount { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### Clear Method

---

|  |
| --- |
| ViewSet Class   See Also |

Removes every view from the set, rendering it empty.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public virtual void Clear() ``` |

| Visual Basic |
| --- |
| ``` Public Overridable Sub Clear ``` |

| Visual C++ |
| --- |
| ``` public: virtual void Clear() ``` |

# See Also

ViewSet Class

Autodesk.Revit.DB Namespace

#### IsDone Method

---

|  |
| --- |
| ConduitSizeIterator Class   See Also |

Identifies if the iteration has completed.

**Namespace:**   Autodesk.Revit.DB.Electrical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.1090.0)
  **Since:**  2017

# Syntax

| C# |
| --- |
| ``` public virtual bool IsDone() ``` |

| Visual Basic |
| --- |
| ``` Public Overridable Function IsDone As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: virtual bool IsDone() ``` |

#### Return Value

True if the iteration has no more items. False if there are more items to be iterated.

# See Also

ConduitSizeIterator Class

Autodesk.Revit.DB.Electrical Namespace

#### LPerSMSup2 Property

---

|  |
| --- |
| SymbolTypeId Class   See Also |

Symbol L/(sÂ·mÂ²), indicating unit Liters per second square meter.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId LPerSMSup2 { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property LPerSMSup2 As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ LPerSMSup2 { 	ForgeTypeId^ get (); } ``` |

# See Also

SymbolTypeId Class

Autodesk.Revit.DB Namespace

#### Reset Method

---

|  |
| --- |
| ReferencePointArrayIterator Class   See Also |

Bring the iterator back to the start of the array.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public virtual void Reset() ``` |

| Visual Basic |
| --- |
| ``` Public Overridable Sub Reset ``` |

| Visual C++ |
| --- |
| ``` public: virtual void Reset() ``` |

#### Implements

 IEnumerator Reset

# Remarks

The Reset method will return the iterator back to the start of the array in line with the definition of IEnumerator. Note that you must call MoveNext before the first item can be accessed via the Current property.

# See Also

ReferencePointArrayIterator Class

Autodesk.Revit.DB Namespace

#### Arc Class

---

|  |
| --- |
| Members   See Also |

A circular arc.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public class Arc : Curve ``` |

| Visual Basic |
| --- |
| ``` Public Class Arc _ 	Inherits Curve ``` |

| Visual C++ |
| --- |
| ``` public ref class Arc : public Curve ``` |

# Remarks

The arc lies in the plane defined by center and normal.

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB APIObject
  Autodesk.Revit.DB GeometryObject
  Autodesk.Revit.DB Curve
  Autodesk.Revit.DB Arc

# See Also

Arc Members

Autodesk.Revit.DB Namespace

#### HasInsulation Property

---

|  |
| --- |
| FabricationPart Class   See Also |

True if the fabrication part is insulated.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.1090.0)
  **Since:**  2017

# Syntax

| C# |
| --- |
| ``` public bool HasInsulation { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property HasInsulation As Boolean 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property bool HasInsulation { 	bool get (); } ``` |

# See Also

FabricationPart Class

Autodesk.Revit.DB Namespace

#### CannotGroupCurtainGridHost Property

---

|  |
| --- |
| BuiltInFailures CurtainWallFailures Class   See Also |

Curtain grid based elements cannot be grouped.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId CannotGroupCurtainGridHost { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property CannotGroupCurtainGridHost As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ CannotGroupCurtainGridHost { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures CurtainWallFailures Class

Autodesk.Revit.DB Namespace

#### RbsElecPanelBussingParam Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Bussing"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId RbsElecPanelBussingParam { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RbsElecPanelBussingParam As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ RbsElecPanelBussingParam { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### GetServiceId Method

---

|  |
| --- |
| IExternalServer Interface   See Also |

Implement this method to return the id of the service.

**Namespace:**   Autodesk.Revit.DB.ExternalService
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` ExternalServiceId GetServiceId() ``` |

| Visual Basic |
| --- |
| ``` Function GetServiceId As ExternalServiceId ``` |

| Visual C++ |
| --- |
| ``` ExternalServiceId^ GetServiceId() ``` |

#### Return Value

The id of the service to which the server belongs.

# Remarks

An external server belongs to only one external service. This method must return an Id that matches the Id of the corresponding service was registered with.

# See Also

IExternalServer Interface

Autodesk.Revit.DB.ExternalService Namespace

#### Size Property

---

|  |
| --- |
| EdgeArray Class   See Also |

Returns the number of edges that are in the array.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public virtual int Size { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Overridable ReadOnly Property Size As Integer 	Get ``` |

| Visual C++ |
| --- |
| ``` public: virtual property int Size { 	int get (); } ``` |

# See Also

EdgeArray Class

Autodesk.Revit.DB Namespace

#### GridlinesOutOfBounds Property

---

|  |
| --- |
| BuiltInFailures CurtainWallFailures Class   See Also |

Manually placed curtain grid lines are on the wall edges or outside the wall boundaries.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId GridlinesOutOfBounds { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property GridlinesOutOfBounds As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ GridlinesOutOfBounds { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures CurtainWallFailures Class

Autodesk.Revit.DB Namespace

#### DividedPathMeasurementType Enumeration

---

|  |
| --- |
| See Also |

DividedPath measurement type.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public enum DividedPathMeasurementType ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration DividedPathMeasurementType ``` |

| Visual C++ |
| --- |
| ``` public enum class DividedPathMeasurementType ``` |

# Members

| Member name | Description |
| --- | --- |
| ChordLength | Distances between two points are measured along a straight line between the points. |
| SegmentLength | Distances between two points are measured along the path segment between the points. |

# See Also

Autodesk.Revit.DB Namespace

#### MoveNext Method

---

|  |
| --- |
| ExportPatternTableIterator Class   See Also |

Increments the iterator to the next item.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public virtual bool MoveNext() ``` |

| Visual Basic |
| --- |
| ``` Public Overridable Function MoveNext As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: virtual bool MoveNext() ``` |

#### Return Value

True if there is a next available item in this iterator. False if the iterator has completed all available items.

# See Also

ExportPatternTableIterator Class

Autodesk.Revit.DB Namespace

#### RemoveConnectedAsset Method

---

|  |
| --- |
| AssetProperty Class   See Also |

Removes the connected asset attached to this asset property if any.

**Namespace:**   Autodesk.Revit.DB.Visual
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2018.1

# Syntax

| C# |
| --- |
| ``` public void RemoveConnectedAsset() ``` |

| Visual Basic |
| --- |
| ``` Public Sub RemoveConnectedAsset ``` |

| Visual C++ |
| --- |
| ``` public: void RemoveConnectedAsset() ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions InvalidOperationException | The asset property is not editable. -or- Cannot check validity for a property not being edited in AppearanceAssetEditScope. |

# See Also

AssetProperty Class

Autodesk.Revit.DB.Visual Namespace

#### DisciplineTypeId Class

---

|  |
| --- |
| Members   See Also |

This class contains constants identifying disciplines.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2022

# Syntax

| C# |
| --- |
| ``` public static class DisciplineTypeId ``` |

| Visual Basic |
| --- |
| ``` Public NotInheritable Class DisciplineTypeId ``` |

| Visual C++ |
| --- |
| ``` public ref class DisciplineTypeId abstract sealed ``` |

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB DisciplineTypeId

# See Also

DisciplineTypeId Members

Autodesk.Revit.DB Namespace

#### OutSideOfHost Property

---

|  |
| --- |
| BuiltInFailures RebarFailures Class   See Also |

Rebar is placed completely outside of its host.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId OutSideOfHost { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property OutSideOfHost As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ OutSideOfHost { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures RebarFailures Class

Autodesk.Revit.DB Namespace

#### ViewDetailLevel Enumeration

---

|  |
| --- |
| See Also |

Detail level of the view

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public enum ViewDetailLevel ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration ViewDetailLevel ``` |

| Visual C++ |
| --- |
| ``` public enum class ViewDetailLevel ``` |

# Members

| Member name | Description |
| --- | --- |
| Undefined | View does not use Detail Level |
| Coarse | Coarse |
| Medium | Medium |
| Fine | Fine |

# See Also

Autodesk.Revit.DB Namespace

#### GetConditionLowerValue Method

---

|  |
| --- |
| FabricationServiceButton Class   See Also |

Gets the condition lower value (valid if greater or equal) for a given condition index.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
  **Since:**  2016

# Syntax

| C# |
| --- |
| ``` public double GetConditionLowerValue( 	int condition ) ``` |

| Visual Basic |
| --- |
| ``` Public Function GetConditionLowerValue ( _ 	condition As Integer _ ) As Double ``` |

| Visual C++ |
| --- |
| ``` public: double GetConditionLowerValue( 	int condition ) ``` |

#### Parameters

condition
:   Type:  System Int32
     The condition index.

#### Return Value

The condition lower value.

# Remarks

A value of -1 indicates an unrestricted value.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | the index condition is not larger or equal to 0 and less than ConditionCount |

# See Also

FabricationServiceButton Class

Autodesk.Revit.DB Namespace

#### PrintRange Enumeration

---

|  |
| --- |
| See Also |

An enumerated type listing all Print Range types of Print.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public enum PrintRange ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration PrintRange ``` |

| Visual C++ |
| --- |
| ``` public enum class PrintRange ``` |

# Members

| Member name | Description |
| --- | --- |
| Current | A range that represents just the currently active view. |
| Visible | Visible portion of current window. |
| Select | A range that represents a list of selected views and sheets. |

# See Also

Autodesk.Revit.DB Namespace

#### SteelElementPreviewTaskNotFinished Property

---

|  |
| --- |
| BuiltInFailures SteelElementFailures Class   See Also |

Cannot create preview while background calculations are in progress.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId SteelElementPreviewTaskNotFinished { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property SteelElementPreviewTaskNotFinished As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ SteelElementPreviewTaskNotFinished { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures SteelElementFailures Class

Autodesk.Revit.DB Namespace

#### SpaceSetIterator Constructor

---

|  |
| --- |
| SpaceSetIterator Class   See Also |

For Internal Use Only.

**Namespace:**   Autodesk.Revit.DB.Mechanical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public SpaceSetIterator() ``` |

| Visual Basic |
| --- |
| ``` Public Sub New ``` |

| Visual C++ |
| --- |
| ``` public: SpaceSetIterator() ``` |

# Remarks

This constructor is exposed to enable support for COM interop only. This object should never be created by the developer.

# See Also

SpaceSetIterator Class

Autodesk.Revit.DB.Mechanical Namespace

#### SymbolicLineInvalidPlane Property

---

|  |
| --- |
| BuiltInFailures GeometryFailures Class   See Also |

Symbolic Element refers to a Work Plane with unacceptable normal.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId SymbolicLineInvalidPlane { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property SymbolicLineInvalidPlane As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ SymbolicLineInvalidPlane { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures GeometryFailures Class

Autodesk.Revit.DB Namespace

#### PhyMaterialParamShearStrengthReduction Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Shear strength modification"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId PhyMaterialParamShearStrengthReduction { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property PhyMaterialParamShearStrengthReduction As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ PhyMaterialParamShearStrengthReduction { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### Reset Method

---

|  |
| --- |
| CableTraySizeIterator Class   See Also |

Resets the iterator to the initial state.

**Namespace:**   Autodesk.Revit.DB.Electrical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.1090.0)
  **Since:**  2017

# Syntax

| C# |
| --- |
| ``` public virtual void Reset() ``` |

| Visual Basic |
| --- |
| ``` Public Overridable Sub Reset ``` |

| Visual C++ |
| --- |
| ``` public: virtual void Reset() ``` |

# See Also

CableTraySizeIterator Class

Autodesk.Revit.DB.Electrical Namespace

#### HostByLinkNavigator Property

---

|  |
| --- |
| DockablePanes BuiltInDockablePanes Class   See Also |

The host by link navigator pane.

**Namespace:**   Autodesk.Revit.UI
  **Assembly:**   RevitAPIUI  (in RevitAPIUI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static DockablePaneId HostByLinkNavigator { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property HostByLinkNavigator As DockablePaneId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property DockablePaneId^ HostByLinkNavigator { 	DockablePaneId^ get (); } ``` |

# See Also

DockablePanes BuiltInDockablePanes Class

Autodesk.Revit.UI Namespace

#### GeometryChecksum Property

---

|  |
| --- |
| FabricationPart Class   See Also |

Gets the geometry checksum of the fabrication part symbol, and it does nothing with the fabrication part instance position.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
  **Since:**  2018.2

# Syntax

| C# |
| --- |
| ``` public AssetPropertyUInt64 GeometryChecksum { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property GeometryChecksum As AssetPropertyUInt64 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property AssetPropertyUInt64^ GeometryChecksum { 	AssetPropertyUInt64^ get (); } ``` |

# See Also

FabricationPart Class

Autodesk.Revit.DB Namespace

#### MinorSpacing Property

---

|  |
| --- |
| FabricSheetType Class   See Also |

The spacing between the wires in the minor direction (not including the overhangs).

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public double MinorSpacing { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property MinorSpacing As Double 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property double MinorSpacing { 	double get (); } ``` |

# See Also

FabricSheetType Class

Autodesk.Revit.DB.Structure Namespace

#### SetFillGrid Method

---

|  |
| --- |
| FillPattern Class   See Also |

Sets the fill grid.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public void SetFillGrid( 	int gridIdx, 	FillGrid fillGrid ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub SetFillGrid ( _ 	gridIdx As Integer, _ 	fillGrid As FillGrid _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void SetFillGrid( 	int gridIdx,  	FillGrid^ fillGrid ) ``` |

#### Parameters

gridIdx
:   Type:  System Int32
     The index of the fill grid.

fillGrid
:   Type:  Autodesk.Revit.DB FillGrid
     The fill grid to be used.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

FillPattern Class

Autodesk.Revit.DB Namespace

#### ExportRoomGeometry Property

---

|  |
| --- |
| NavisworksExportOptions Class   See Also |

True to export Revit room geometry, false otherwise. Default value is true.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public bool ExportRoomGeometry { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property ExportRoomGeometry As Boolean 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property bool ExportRoomGeometry { 	bool get (); 	void set (bool value); } ``` |

# See Also

NavisworksExportOptions Class

Autodesk.Revit.DB Namespace

#### FabricSheet Class

---

|  |
| --- |
| Members   See Also |

An object that represents an Fabric Sheet Element within the Autodesk Revit project.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public class FabricSheet : Element ``` |

| Visual Basic |
| --- |
| ``` Public Class FabricSheet _ 	Inherits Element ``` |

| Visual C++ |
| --- |
| ``` public ref class FabricSheet : public Element ``` |

# Remarks

Beginning with Revit 2016, fabric sheets can be either flat or bent. Both kinds of fabric sheets are implemented by this FabricSheet class. Fabric sheets are created as either flat or bent. Once created, the kind of a fabric sheet cannot be changed. The Fabric Sheet element is available only in the Autodesk Revit Structure product.

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB Element
  Autodesk.Revit.DB.Structure FabricSheet

# See Also

FabricSheet Members

Autodesk.Revit.DB.Structure Namespace

#### ForgeTypeId Constructor

---

|  |
| --- |
| ForgeTypeId Class   See Also |

Constructs a ForgeTypeId holding an empty schema identifier.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public ForgeTypeId() ``` |

| Visual Basic |
| --- |
| ``` Public Sub New ``` |

| Visual C++ |
| --- |
| ``` public: ForgeTypeId() ``` |

# See Also

ForgeTypeId Class

ForgeTypeId Overload

Autodesk.Revit.DB Namespace

#### Create Method

---

|  |
| --- |
| IndependentTag Class   Example   See Also |

Places a tag on an element or subelement.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2018

# Syntax

| C# |
| --- |
| ``` public static IndependentTag Create( 	Document document, 	ElementId ownerDBViewId, 	Reference referenceToTag, 	bool addLeader, 	TagMode tagMode, 	TagOrientation tagOrientation, 	XYZ pnt ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function Create ( _ 	document As Document, _ 	ownerDBViewId As ElementId, _ 	referenceToTag As Reference, _ 	addLeader As Boolean, _ 	tagMode As TagMode, _ 	tagOrientation As TagOrientation, _ 	pnt As XYZ _ ) As IndependentTag ``` |

| Visual C++ |
| --- |
| ``` public: static IndependentTag^ Create( 	Document^ document,  	ElementId^ ownerDBViewId,  	Reference^ referenceToTag,  	bool addLeader,  	TagMode tagMode,  	TagOrientation tagOrientation,  	XYZ^ pnt ) ``` |

#### Parameters

document
:   Type:  Autodesk.Revit.DB Document
     The document to which the tag will be added.

ownerDBViewId
:   Type:  Autodesk.Revit.DB ElementId
     The view in which the tag will be visible.

referenceToTag
:   Type:  Autodesk.Revit.DB Reference
     The host reference of the tag. The reference can be to an element or subelement in a local or linked document.

addLeader
:   Type:  System Boolean
     When true, the tag will be created with a straight leader with an attached end.

tagMode
:   Type:  Autodesk.Revit.DB TagMode
     This argument determines the type of tag that will be created. Tag by category, multi-category tag, and material tag are allowed.

tagOrientation
:   Type:  Autodesk.Revit.DB TagOrientation
     The orientation of the tag's head.

pnt
:   Type:  Autodesk.Revit.DB XYZ
     For tags without leaders, this point is the position of the tag head. For tags with leaders, this point is the end point of the leader, and a leader of default length will be created from this point to the tag head.

#### Return Value

If successful the new tag is returned.

# Remarks

Single category tags, multi-category tags and material tags can be placed.

# Examples

 Copy  C#

```
private IndependentTag CreateIndependentTag(Autodesk.Revit.DB.Document document, Wall wall)
{
    // make sure active view is not a 3D view
    Autodesk.Revit.DB.View view = document.ActiveView;

    // define tag mode and tag orientation for new tag
    TagMode tagMode = TagMode.TM_ADDBY_CATEGORY;
    TagOrientation tagorn = TagOrientation.Horizontal;

    // Add the tag to the middle of the wall
    LocationCurve wallLoc = wall.Location as LocationCurve;
    XYZ wallStart = wallLoc.Curve.GetEndPoint(0);
    XYZ wallEnd = wallLoc.Curve.GetEndPoint(1);
    XYZ wallMid = wallLoc.Curve.Evaluate(0.5, true);
    Reference wallRef = new Reference(wall);

    IndependentTag newTag = IndependentTag.Create(document, view.Id,  wallRef, true, tagMode, tagorn, wallMid);
    if (null == newTag)
    {
        throw new Exception("Create IndependentTag Failed.");
    }

    // newTag.TagText is read-only, so we change the Type Mark type parameter to
    // set the tag text.  The label parameter for the tag family determines
    // what type parameter is used for the tag text.

    WallType type = wall.WallType;

    Parameter foundParameter = type.LookupParameter("Type Mark");
    bool result = foundParameter.Set("Hello");

    // set leader mode free
    // otherwise leader end point move with elbow point

    newTag.LeaderEndCondition = LeaderEndCondition.Free;
    XYZ elbowPnt = wallMid + new XYZ(5.0, 5.0, 0.0);
    newTag.SetLeaderElbow(wallRef, elbowPnt);
    XYZ headerPnt = wallMid + new XYZ(10.0, 10.0, 0.0);
    newTag.TagHeadPosition = headerPnt;

    // change tag orientation to AnyModelDirection
    newTag.TagOrientation = TagOrientation.AnyModelDirection;

    // change tag rotation angle to PI/4
    newTag.RotationAngle = Math.PI / 4;

    return newTag;
}
```

 Copy  VB.NET

```
Private Function CreateIndependentTag(document As Autodesk.Revit.DB.Document, wall As Wall) As IndependentTag
      ' make sure active view is not a 3D view
      Dim view As Autodesk.Revit.DB.View = document.ActiveView

      ' define tag mode and tag orientation for new tag
      Dim tagMode__1 As TagMode = TagMode.TM_ADDBY_CATEGORY
      Dim tagorn As TagOrientation = TagOrientation.Horizontal

      ' Add the tag to the middle of the wall
      Dim wallLoc As LocationCurve = TryCast(wall.Location, LocationCurve)
      Dim wallStart As XYZ = wallLoc.Curve.GetEndPoint(0)
      Dim wallEnd As XYZ = wallLoc.Curve.GetEndPoint(1)
      Dim wallMid As XYZ = wallLoc.Curve.Evaluate(0.5, True)
   Dim WallRef As Reference = New Reference(wall)

   Dim newTag As IndependentTag = IndependentTag.Create(document, view.Id, wallRef, True, tagMode__1, tagorn, wallMid)
      If newTag Is Nothing Then
          Throw New Exception("Create IndependentTag Failed.")
      End If

      ' newTag.TagText is read-only, so we change the Type Mark type parameter to
      ' set the tag text.  The label parameter for the tag family determines
      ' what type parameter is used for the tag text.

      Dim type As WallType = wall.WallType

      Dim foundParameter As Parameter = type.LookupParameter("Type Mark")
      Dim result As Boolean = foundParameter.Set

      ' set leader mode free
      ' otherwise leader end point move with elbow point

      newTag.LeaderEndCondition = LeaderEndCondition.Free
      Dim elbowPnt As XYZ = wallMid + New XYZ(5.0, 5.0, 0.0)
      newTag.SetLeaderElbow(WallRef, elbowPnt)
      Dim headerPnt As XYZ = wallMid + New XYZ(10.0, 10.0, 0.0)
      newTag.TagHeadPosition = headerPnt

      ' change tag orientation to AnyModelDirection
      newTag.TagOrientation = TagOrientation.AnyModelDirection

      ' change tag rotation angle to PI/4
      newTag.RotationAngle = Math.PI / 4

      Return newTag
  End Function
```

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | The ElementId ownerDBViewId does not correspond to a View. -or- The ElementId ownerDBViewId is a view template. -or- The ElementId ownerDBViewId is a perspective view. -or- The 3D view ownerDBViewId is not locked. -or- The reference can not be tagged. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |
| Autodesk.Revit.Exceptions InternalException | Tag creation failed. |
| Autodesk.Revit.Exceptions InvalidOperationException | There is no loaded tag type that can be used when tagging referenceToTag with tagMode. |
| Autodesk.Revit.Exceptions ModificationForbiddenException | The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements). -or- The document is being loaded, or is in the midst of another sensitive process. |
| Autodesk.Revit.Exceptions ModificationOutsideTransactionException | The document has no open transaction. |

# See Also

IndependentTag Class

Create Overload

Autodesk.Revit.DB Namespace

#### GetTemporaryViewPropertiesId Method

---

|  |
| --- |
| View Class   See Also |

When Temporary View Properties mode is in progress it provides view id that overrode settings for current view. Outside Temporary View Properties mode InvalidElementId will be returned.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public ElementId GetTemporaryViewPropertiesId() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetTemporaryViewPropertiesId As ElementId ``` |

| Visual C++ |
| --- |
| ``` public: ElementId^ GetTemporaryViewPropertiesId() ``` |

# Remarks

Returned ElementId might refer to element that was deleted. It will happen when Temporary View Properties mode was applied basing on template that next was deleted.

# See Also

View Class

Autodesk.Revit.DB Namespace

#### IfcTypeGuid Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Type IfcGUID"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId IfcTypeGuid { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property IfcTypeGuid As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ IfcTypeGuid { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### CreateElectricalLoadAreas Method

---

|  |
| --- |
| ElectricalLoadAreaData Class   See Also |

Creates electrical load areas on all the empty plan circuits of the given level.

**Namespace:**   Autodesk.Revit.DB.Electrical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
  **Since:**  2023

# Syntax

| C# |
| --- |
| ``` public static ISet<ElementId> CreateElectricalLoadAreas( 	Document doc, 	ElementId levelId, 	ElementId phaseId ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function CreateElectricalLoadAreas ( _ 	doc As Document, _ 	levelId As ElementId, _ 	phaseId As ElementId _ ) As ISet(Of ElementId) ``` |

| Visual C++ |
| --- |
| ``` public: static ISet<ElementId^>^ CreateElectricalLoadAreas( 	Document^ doc,  	ElementId^ levelId,  	ElementId^ phaseId ) ``` |

#### Parameters

doc
:   Type:  Autodesk.Revit.DB Document
     The document where the created electrical load areas are.

levelId
:   Type:  Autodesk.Revit.DB ElementId
     The base level on which the created electrical load areas exist.

phaseId
:   Type:  Autodesk.Revit.DB ElementId
     The associated phase in which the created electrical load areas exist.

#### Return Value

The created electrical load areas.

# Remarks

Use the  HasCircuitsWithoutElectricalLoadAreas  to check whether there are empty plan circuits in which there are no electrical load areas, if there are empty plan circuits, this API will create electrical load areas on each of them, otherwise, it will create nothing. In most cases, the electrical load areas will be created, updated and deleted automatically, but in some cases, there are some empty plan circuits and need to create electrical load areas on each of them.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | doc is not a project document. -or- The ElementId levelId is not a Level. -or- The id does not represent a valid phase. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions InvalidOperationException | The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements). |
| Autodesk.Revit.Exceptions ModificationForbiddenException | The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements). -or- The document is being loaded, or is in the midst of another sensitive process. |
| Autodesk.Revit.Exceptions ModificationOutsideTransactionException | The document has no open transaction. |

# See Also

ElectricalLoadAreaData Class

Autodesk.Revit.DB.Electrical Namespace

#### FabricationSpecification Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Specification"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId FabricationSpecification { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property FabricationSpecification As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ FabricationSpecification { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### Dispose Method

---

|  |
| --- |
| KeyBasedTreeEntry Class   See Also |

Releases all resources used by the  KeyBasedTreeEntry

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public void Dispose() ``` |

| Visual Basic |
| --- |
| ``` Public Sub Dispose ``` |

| Visual C++ |
| --- |
| ``` public: virtual void Dispose() sealed ``` |

#### Implements

 IDisposable Dispose

# See Also

KeyBasedTreeEntry Class

Autodesk.Revit.DB Namespace

#### IFCTransaction Constructor

---

|  |
| --- |
| IFCTransaction Class   See Also |

Instantiates a transaction object.

**Namespace:**   Autodesk.Revit.DB.IFC
  **Assembly:**   RevitAPIIFC  (in RevitAPIIFC.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public IFCTransaction( 	IFCFile file ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub New ( _ 	file As IFCFile _ ) ``` |

| Visual C++ |
| --- |
| ``` public: IFCTransaction( 	IFCFile^ file ) ``` |

#### Parameters

file
:   Type:  Autodesk.Revit.DB.IFC IFCFile
     The IFC file for which this transaction is going to be used.

# Remarks

The transaction starts by creating a transaction object.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

IFCTransaction Class

Autodesk.Revit.DB.IFC Namespace

#### AreaReinforcementType Class

---

|  |
| --- |
| Members   See Also |

An object that specifies the type of a Structural Area Reinforcement element in Autodesk Revit.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public class AreaReinforcementType : ElementType ``` |

| Visual Basic |
| --- |
| ``` Public Class AreaReinforcementType _ 	Inherits ElementType ``` |

| Visual C++ |
| --- |
| ``` public ref class AreaReinforcementType : public ElementType ``` |

# Remarks

The clear cover settings can be accessed via this object.

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB Element
  Autodesk.Revit.DB ElementType
  Autodesk.Revit.DB.Structure AreaReinforcementType

# See Also

AreaReinforcementType Members

Autodesk.Revit.DB.Structure Namespace

#### WrappingAtEndsParam Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Wrapping at Ends"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId WrappingAtEndsParam { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property WrappingAtEndsParam As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ WrappingAtEndsParam { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### Insert Method

---

|  |
| --- |
| EdgeArrayArray Class   See Also |

Insert the specified edge array into the array.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public virtual void Insert( 	EdgeArray item, 	int index ) ``` |

| Visual Basic |
| --- |
| ``` Public Overridable Sub Insert ( _ 	item As EdgeArray, _ 	index As Integer _ ) ``` |

| Visual C++ |
| --- |
| ``` public: virtual void Insert( 	EdgeArray^ item,  	int index ) ``` |

#### Parameters

item
:   Type:  Autodesk.Revit.DB EdgeArray
     The edge array to be inserted into the array.

index
:   Type:  System Int32
     The edge array will be inserted before this index.

#### Return Value

Returns whether the edge array was inserted into the array.

# See Also

EdgeArrayArray Class

Autodesk.Revit.DB Namespace

#### Dispose Method

---

|  |
| --- |
| RebarFreeFormAccessor Class   See Also |

Releases all resources used by the  RebarFreeFormAccessor

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)

# Syntax

| C# |
| --- |
| ``` public void Dispose() ``` |

| Visual Basic |
| --- |
| ``` Public Sub Dispose ``` |

| Visual C++ |
| --- |
| ``` public: virtual void Dispose() sealed ``` |

#### Implements

 IDisposable Dispose

# See Also

RebarFreeFormAccessor Class

Autodesk.Revit.DB.Structure Namespace

#### SetEqualityFormula Method

---

|  |
| --- |
| DimensionType Class   See Also |

Sets an ordered list of the entries to use in the equality formula definition.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2017 Subscription Update

# Syntax

| C# |
| --- |
| ``` public void SetEqualityFormula( 	IList<DimensionEqualityLabelFormatting> formattingArr ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub SetEqualityFormula ( _ 	formattingArr As IList(Of DimensionEqualityLabelFormatting) _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void SetEqualityFormula( 	IList<DimensionEqualityLabelFormatting^>^ formattingArr ) ``` |

#### Parameters

formattingArr
:   Type:  System.Collections.Generic IList   DimensionEqualityLabelFormatting
     An ordered list of the entries to use in the equality formula definition.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | The input equality formula entries are not valid for use in the given DimensionType. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

DimensionType Class

Autodesk.Revit.DB Namespace

#### RoomNumber Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Number"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId RoomNumber { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RoomNumber As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ RoomNumber { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### BoundingBoxIntersectsFilter Class

---

|  |
| --- |
| Members   Example   See Also |

A filter used to match elements with a bounding box that intersects the given Outline.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public class BoundingBoxIntersectsFilter : ElementQuickFilter ``` |

| Visual Basic |
| --- |
| ``` Public Class BoundingBoxIntersectsFilter _ 	Inherits ElementQuickFilter ``` |

| Visual C++ |
| --- |
| ``` public ref class BoundingBoxIntersectsFilter : public ElementQuickFilter ``` |

# Remarks

This filter excludes all objects derived from View and objects derived from ElementType. This filter is a quick filter. Quick filters operate only on the ElementRecord, a low-memory class which has a limited interface to read element properties. Elements which are rejected by a quick filter will not be expanded in memory.

# Examples

 Copy  C#

```
// Use BoundingBoxIntersects filter to find elements with a bounding box that intersects the
// given Outline in the document.

// Create a Outline, uses a minimum and maximum XYZ point to initialize the outline.
Outline myOutLn = new Outline(new XYZ(0, 0, 0), new XYZ(100, 100, 100));

// Create a BoundingBoxIntersects filter with this Outline
BoundingBoxIntersectsFilter filter = new BoundingBoxIntersectsFilter(myOutLn);

// Apply the filter to the elements in the active document
// This filter excludes all objects derived from View and objects derived from ElementType
FilteredElementCollector collector = new FilteredElementCollector(document);
IList<Element> elements = collector.WherePasses(filter).ToElements();

// Find all walls which don't intersect with BoundingBox: use an inverted filter to match elements
// Use shortcut command OfClass() to find walls only
BoundingBoxIntersectsFilter invertFilter = new BoundingBoxIntersectsFilter(myOutLn, true); // inverted filter
collector = new FilteredElementCollector(document);
IList<Element> notIntersectWalls =
    collector.OfClass(typeof(Wall)).WherePasses(invertFilter).ToElements();
```

 Copy  VB.NET

```
' Use BoundingBoxIntersects filter to find elements with a bounding box that intersects the
' given Outline in the document.

' Create a Outline, uses a minimum and maximum XYZ point to initialize the outline.
Dim myOutLn As New Outline(New XYZ(0, 0, 0), New XYZ(100, 100, 100))

' Create a BoundingBoxIntersects filter with this Outline
Dim filter As New BoundingBoxIntersectsFilter(myOutLn)

' Apply the filter to the elements in the active document
' This filter excludes all objects derived from View and objects derived from ElementType
Dim collector As New FilteredElementCollector(document)
Dim elements As IList(Of Element) = collector.WherePasses(filter).ToElements()

' Find all walls which don't intersect with BoundingBox: use an inverted filter to match elements
' Use shortcut command OfClass() to find walls only
Dim invertFilter As New BoundingBoxIntersectsFilter(myOutLn, True)
' inverted filter
collector = New FilteredElementCollector(document)
Dim notIntersectWalls As IList(Of Element) = collector.OfClass(GetType(Wall)).WherePasses(invertFilter).ToElements()
```

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB ElementFilter
  Autodesk.Revit.DB ElementQuickFilter
  Autodesk.Revit.DB BoundingBoxIntersectsFilter

# See Also

BoundingBoxIntersectsFilter Members

Autodesk.Revit.DB Namespace

#### CurveRoofSkippedLoops Property

---

|  |
| --- |
| BuiltInFailures RoofFailures Class   See Also |

Some loops were skipped

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId CurveRoofSkippedLoops { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property CurveRoofSkippedLoops As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ CurveRoofSkippedLoops { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures RoofFailures Class

Autodesk.Revit.DB Namespace

#### Assign Method

---

|  |
| --- |
| DirectContext3DHandleSettings Class   See Also |

Assigns values of the source settings to this object.

**Namespace:**   Autodesk.Revit.DB.DirectContext3D
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2018

# Syntax

| C# |
| --- |
| ``` public void Assign( 	DirectContext3DHandleSettings other ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub Assign ( _ 	other As DirectContext3DHandleSettings _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void Assign( 	DirectContext3DHandleSettings^ other ) ``` |

#### Parameters

other
:   Type:  Autodesk.Revit.DB.DirectContext3D DirectContext3DHandleSettings
     The source settings.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

DirectContext3DHandleSettings Class

Autodesk.Revit.DB.DirectContext3D Namespace

#### FindEntry Method

---

|  |
| --- |
| KeyBasedTreeEntries Class   See Also |

Finds the KeyBasedTreeEntry associated with the given key value.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2015

# Syntax

| C# |
| --- |
| ``` public KeyBasedTreeEntry FindEntry( 	string key ) ``` |

| Visual Basic |
| --- |
| ``` Public Function FindEntry ( _ 	key As String _ ) As KeyBasedTreeEntry ``` |

| Visual C++ |
| --- |
| ``` public: KeyBasedTreeEntry^ FindEntry( 	String^ key ) ``` |

#### Parameters

key
:   Type:  System String
     The specified key value.

#### Return Value

The KeyBasedTreeEntry corresponds to the given key value.

# Remarks

If no matching KeyBasedTreeEntry can be found, null will be returned; The given key value cannot be an empty string.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | key is an empty string. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

KeyBasedTreeEntries Class

Autodesk.Revit.DB Namespace

#### CanBeSplit Property

---

|  |
| --- |
| ViewCropRegionShapeManager Class   See Also |

Verifies that the crop of the associated view is permitted to have multiple regions.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
  **Since:**  2016

# Syntax

| C# |
| --- |
| ``` public bool CanBeSplit { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property CanBeSplit As Boolean 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property bool CanBeSplit { 	bool get (); } ``` |

# See Also

ViewCropRegionShapeManager Class

Autodesk.Revit.DB Namespace

#### MemberDifference Property

---

|  |
| --- |
| AssemblyDifferenceMemberDifference Class   See Also |

Difference between the assembly members

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public AssemblyMemberDifference MemberDifference { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property MemberDifference As AssemblyMemberDifference 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property AssemblyMemberDifference^ MemberDifference { 	AssemblyMemberDifference^ get (); } ``` |

# See Also

AssemblyDifferenceMemberDifference Class

Autodesk.Revit.DB Namespace

#### SetDepthCueing Method

---

|  |
| --- |
| View Class   See Also |

Sets the depth cueing settings for the view.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2017

# Syntax

| C# |
| --- |
| ``` public void SetDepthCueing( 	ViewDisplayDepthCueing depthCueing ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub SetDepthCueing ( _ 	depthCueing As ViewDisplayDepthCueing _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void SetDepthCueing( 	ViewDisplayDepthCueing^ depthCueing ) ``` |

#### Parameters

depthCueing
:   Type:  Autodesk.Revit.DB ViewDisplayDepthCueing
     Depth cueing settings to set.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions InvalidOperationException | This view does not contain display-related properties. -or- This view cannot use Depth Cueing |

# See Also

View Class

Autodesk.Revit.DB Namespace

#### PanelScheduleSheetInstance Class

---

|  |
| --- |
| Members   See Also |

The class represents an instance of a panel schedule placed on sheet.

**Namespace:**   Autodesk.Revit.DB.Electrical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public class PanelScheduleSheetInstance : Element ``` |

| Visual Basic |
| --- |
| ``` Public Class PanelScheduleSheetInstance _ 	Inherits Element ``` |

| Visual C++ |
| --- |
| ``` public ref class PanelScheduleSheetInstance : public Element ``` |

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB Element
  Autodesk.Revit.DB.Electrical PanelScheduleSheetInstance

# See Also

PanelScheduleSheetInstance Members

Autodesk.Revit.DB.Electrical Namespace

#### LineLightShape Constructor (Double)

---

|  |
| --- |
| LineLightShape Class   See Also |

Creates a line light shape object with the given emit length.

**Namespace:**   Autodesk.Revit.DB.Lighting
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public LineLightShape( 	double emitLength ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub New ( _ 	emitLength As Double _ ) ``` |

| Visual C++ |
| --- |
| ``` public: LineLightShape( 	double emitLength ) ``` |

#### Parameters

emitLength
:   Type:  System Double
     The emit length as a numerical value in feet between 1.0e-9 and 30000.0

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | The shape dimension is not valid because it is not between 1.0e-9 and 30000.0. |

# See Also

LineLightShape Class

LineLightShape Overload

Autodesk.Revit.DB.Lighting Namespace

#### ViewPhase Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Phase"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId ViewPhase { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property ViewPhase As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ ViewPhase { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### Profile Property

---

|  |
| --- |
| Sketch Class   See Also |

Returns the Profile of the Sketch.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public CurveArrArray Profile { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property Profile As CurveArrArray 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property CurveArrArray^ Profile { 	CurveArrArray^ get (); } ``` |

# Remarks

This property is used to retrieve the Profile of Sketch.

# See Also

Sketch Class

Autodesk.Revit.DB Namespace

#### AddStackedItems Method (RibbonItemData, RibbonItemData)

---

|  |
| --- |
| RibbonPanel Class   See Also |

Adds two stacked items to the panel.

**Namespace:**   Autodesk.Revit.UI
  **Assembly:**   RevitAPIUI  (in RevitAPIUI.dll) Version: 17.0.0.0 (17.0.1090.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public IList<RibbonItem> AddStackedItems( 	RibbonItemData item1, 	RibbonItemData item2 ) ``` |

| Visual Basic |
| --- |
| ``` Public Function AddStackedItems ( _ 	item1 As RibbonItemData, _ 	item2 As RibbonItemData _ ) As IList(Of RibbonItem) ``` |

| Visual C++ |
| --- |
| ``` public: IList<RibbonItem^>^ AddStackedItems( 	RibbonItemData^ item1,  	RibbonItemData^ item2 ) ``` |

#### Parameters

item1
:   Type:  Autodesk.Revit.UI RibbonItemData
     Data containing information about the first item. This data must be of type PushButtonData, PulldownButtonData, SplitButtonData, ComboBoxData, or TextBoxData.

item2
:   Type:  Autodesk.Revit.UI RibbonItemData
     Data containing information about the second item. This data must be of type PushButtonData, PulldownButtonData, SplitButtonData, ComboBoxData, or TextBoxData.

#### Return Value

A collection containing the added items.

# Remarks

Each new item may either be a PushButton, PulldownButton, SplitButton, ComboBox or TextBox, depending upon the type of data passed in for each argument. The new items will be created as small-size horizontal controls, with the first stacked on top of the second in the panel.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | Thrown when item1 or item2 is    a null reference (  Nothing  in Visual Basic)  . |
| Autodesk.Revit.Exceptions ArgumentException | Thrown when an item with the item1.Name or item2.Name already exists in the panel or the data is not of the correct type. |

# See Also

RibbonPanel Class

AddStackedItems Overload

Autodesk.Revit.UI Namespace

#### Size Property

---

|  |
| --- |
| PlanTopologySet Class   See Also |

Returns the number of objects that are in the set.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public virtual int Size { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Overridable ReadOnly Property Size As Integer 	Get ``` |

| Visual C++ |
| --- |
| ``` public: virtual property int Size { 	int get (); } ``` |

# See Also

PlanTopologySet Class

Autodesk.Revit.DB Namespace

#### CubicMetersPerSecond Property

---

|  |
| --- |
| UnitTypeId Class   See Also |

Cubic meters per second.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId CubicMetersPerSecond { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property CubicMetersPerSecond As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ CubicMetersPerSecond { 	ForgeTypeId^ get (); } ``` |

# See Also

UnitTypeId Class

Autodesk.Revit.DB Namespace

#### TotalLoad Property

---

|  |
| --- |
| ElectricalAnalyticalNode Class   See Also |

The Total Connected Load.

**Namespace:**   Autodesk.Revit.DB.Electrical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
  **Since:**  2023

# Syntax

| C# |
| --- |
| ``` public double TotalLoad { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property TotalLoad As Double 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property double TotalLoad { 	double get (); } ``` |

# See Also

ElectricalAnalyticalNode Class

Autodesk.Revit.DB.Electrical Namespace

#### AssetPropertyDoubleArray4d Class

---

|  |
| --- |
| Members   See Also |

Represents a color property of material.

**Namespace:**   Autodesk.Revit.DB.Visual
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)

# Syntax

| C# |
| --- |
| ``` public class AssetPropertyDoubleArray4d : AssetProperty ``` |

| Visual Basic |
| --- |
| ``` Public Class AssetPropertyDoubleArray4d _ 	Inherits AssetProperty ``` |

| Visual C++ |
| --- |
| ``` public ref class AssetPropertyDoubleArray4d : public AssetProperty ``` |

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB.Visual AssetProperty
  Autodesk.Revit.DB.Visual AssetPropertyDoubleArray4d

# See Also

AssetPropertyDoubleArray4d Members

Autodesk.Revit.DB.Visual Namespace

#### IsAllowedForSolidCut Method

---

|  |
| --- |
| SolidSolidCutUtils Class   See Also |

Validates that the element is eligible for a solid-solid cut.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public static bool IsAllowedForSolidCut( 	Element element ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function IsAllowedForSolidCut ( _ 	element As Element _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: static bool IsAllowedForSolidCut( 	Element^ element ) ``` |

#### Parameters

element
:   Type:  Autodesk.Revit.DB Element
     The solid to be cut or the cutting solid.

#### Return Value

True if the input element can participate in a solid-solid cut. False otherwise.

# Remarks

The element must be solid and must be a GenericForm, GeomCombination, or a FamilyInstance.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

SolidSolidCutUtils Class

Autodesk.Revit.DB Namespace

#### SystemtypeRisedrop Property

---

|  |
| --- |
| GroupTypeId Class   See Also |

"Rise / Drop"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId SystemtypeRisedrop { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property SystemtypeRisedrop As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ SystemtypeRisedrop { 	ForgeTypeId^ get (); } ``` |

# See Also

GroupTypeId Class

Autodesk.Revit.DB Namespace

#### GetCenterlineCurves Method

---

|  |
| --- |
| RebarInSystem Class   See Also |

A chain of curves representing the centerline of the rebar.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public IList<Curve> GetCenterlineCurves( 	bool adjustForSelfIntersection, 	bool suppressHooks, 	bool suppressBendRadius ) ``` |

| Visual Basic |
| --- |
| ``` Public Function GetCenterlineCurves ( _ 	adjustForSelfIntersection As Boolean, _ 	suppressHooks As Boolean, _ 	suppressBendRadius As Boolean _ ) As IList(Of Curve) ``` |

| Visual C++ |
| --- |
| ``` public: IList<Curve^>^ GetCenterlineCurves( 	bool adjustForSelfIntersection,  	bool suppressHooks,  	bool suppressBendRadius ) ``` |

#### Parameters

adjustForSelfIntersection
:   Type:  System Boolean
     If the curves overlap, as in a planar stirrup, this parameter controls whether they should be adjusted to avoid intersection (as in fine views), or kept in a single plane for simplicity (as in coarse views).

suppressHooks
:   Type:  System Boolean
     Identifies if the chain will include hooks curves.

suppressBendRadius
:   Type:  System Boolean
     Identifies if the connected chain will include unfilleted curves.

#### Return Value

The centerline curves or empty array if the curves cannot be computed because the parameters values are inconsistent with the constraints of the RebarShape definition.

# Remarks

This method will return the centerline curves for the first bar in set even if this bar isn't included.

# See Also

RebarInSystem Class

Autodesk.Revit.DB.Structure Namespace

#### SetColor Method

---

|  |
| --- |
| VertexPositionNormalColored Class   See Also |

Sets the vertex's color.

**Namespace:**   Autodesk.Revit.DB.DirectContext3D
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2017

# Syntax

| C# |
| --- |
| ``` public void SetColor( 	ColorWithTransparency color ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub SetColor ( _ 	color As ColorWithTransparency _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void SetColor( 	ColorWithTransparency^ color ) ``` |

#### Parameters

color
:   Type:  Autodesk.Revit.DB ColorWithTransparency
     The vertex's color.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

VertexPositionNormalColored Class

Autodesk.Revit.DB.DirectContext3D Namespace

#### AirFanType Property

---

|  |
| --- |
| AirSystemData Class   See Also |

The fan type.

**Namespace:**   Autodesk.Revit.DB.Mechanical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
  **Since:**  2020.1

# Syntax

| C# |
| --- |
| ``` public AirFanType AirFanType { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property AirFanType As AirFanType 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property AirFanType AirFanType { 	AirFanType get (); 	void set (AirFanType value); } ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also

AirSystemData Class

Autodesk.Revit.DB.Mechanical Namespace

#### SplitSegment Method

---

|  |
| --- |
| ViewSchedule Class   See Also |

Splits the schedule segment by the given heights of new segments.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
  **Since:**  2022.1

# Syntax

| C# |
| --- |
| ``` public void SplitSegment( 	int segmentIndex, 	IList<double> segmentHeights ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub SplitSegment ( _ 	segmentIndex As Integer, _ 	segmentHeights As IList(Of Double) _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void SplitSegment( 	int segmentIndex,  	IList<double>^ segmentHeights ) ``` |

#### Parameters

segmentIndex
:   Type:  System Int32
     The index of segment, starting with 0.

segmentHeights
:   Type:  System.Collections.Generic IList   Double
     An array contains the height for each new segment except the last segment. The height of the last segment will be determined by the height of previous new segments and the height of the split segment.

# Remarks

The height values are used to set the height of schedule instance for each segment shown on sheet view. Each input height must be greater than 0 and the total height must be less than the height of the split segment.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | The height of a schedule segment must be greater than 0. The total height must be less than the split segment height. The total segment count must be greater than 0 and less than 10000. -or- The segment index should start from 0 and be less than the total segment count. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions InvalidOperationException | This ViewSchedule is not split yet. |

# See Also

ViewSchedule Class

Autodesk.Revit.DB Namespace

#### KipPerFtSup2 Property

---

|  |
| --- |
| SymbolTypeId Class   See Also |

Symbol kip/ftÂ², indicating unit Kips per square foot.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId KipPerFtSup2 { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property KipPerFtSup2 As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ KipPerFtSup2 { 	ForgeTypeId^ get (); } ``` |

# See Also

SymbolTypeId Class

Autodesk.Revit.DB Namespace

#### IsValidObject Property

---

|  |
| --- |
| RebarShapeParameters Class   See Also |

Specifies whether the .NET object represents a valid Revit entity.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public bool IsValidObject { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property IsValidObject As Boolean 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property bool IsValidObject { 	bool get (); } ``` |

#### Return Value

True if the API object holds a valid Revit native object, false otherwise.

# Remarks

If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone, a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.

# See Also

RebarShapeParameters Class

Autodesk.Revit.DB.Structure Namespace

#### Outline Class

---

|  |
| --- |
| Members   See Also |

Outline is a generic object that provides a bounding box/bounding outline. It supports operations to scale and transform. It also supports intersections and contains operations.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public class Outline : IDisposable ``` |

| Visual Basic |
| --- |
| ``` Public Class Outline _ 	Implements IDisposable ``` |

| Visual C++ |
| --- |
| ``` public ref class Outline : IDisposable ``` |

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB Outline

# See Also

Outline Members

Autodesk.Revit.DB Namespace

#### InlineEndoflineMismatch Property

---

|  |
| --- |
| BuiltInFailures GenericMEPFailures Class   See Also |

[Element Name]: It is not possible to calculate the flow since there is inline equipment that is configured as end of line. Please check equipment in this system and make sure that the equipment connectors used inline have a global system classification and a calculated flow configuration. Global equipment connectors used inline should always be linked to each other.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.1090.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId InlineEndoflineMismatch { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property InlineEndoflineMismatch As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ InlineEndoflineMismatch { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures GenericMEPFailures Class

Autodesk.Revit.DB Namespace

#### BoundaryRestraintRotZ Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Z Spring Modulus"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId BoundaryRestraintRotZ { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property BoundaryRestraintRotZ As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ BoundaryRestraintRotZ { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### Pulsation Property

---

|  |
| --- |
| SpecTypeId Class   See Also |

Pulsation, in discipline Structural.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId Pulsation { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property Pulsation As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ Pulsation { 	ForgeTypeId^ get (); } ``` |

# See Also

SpecTypeId Class

Autodesk.Revit.DB Namespace

#### BarsTooCloseNumber Property

---

|  |
| --- |
| BuiltInFailures RebarSystemFailures Class   See Also |

Bars are too close together. Decrease the Number Of Lines parameter.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId BarsTooCloseNumber { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property BarsTooCloseNumber As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ BarsTooCloseNumber { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures RebarSystemFailures Class

Autodesk.Revit.DB Namespace

#### MSup3PerWS Property

---

|  |
| --- |
| SymbolTypeId Class   See Also |

Symbol mÂ³/(WÂ·s), indicating unit Cubic meters per watt second.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId MSup3PerWS { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property MSup3PerWS As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ MSup3PerWS { 	ForgeTypeId^ get (); } ``` |

# See Also

SymbolTypeId Class

Autodesk.Revit.DB Namespace

#### LocateFabricationConnector Method

---

|  |
| --- |
| FabricationConfiguration Class   See Also |

Gets the fabrication connector identifiers by group and name, filtered by shape and domain.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2016

# Syntax

| C# |
| --- |
| ``` public int LocateFabricationConnector( 	string group, 	string name, 	ConnectorDomainType domain, 	ConnectorProfileType shape ) ``` |

| Visual Basic |
| --- |
| ``` Public Function LocateFabricationConnector ( _ 	group As String, _ 	name As String, _ 	domain As ConnectorDomainType, _ 	shape As ConnectorProfileType _ ) As Integer ``` |

| Visual C++ |
| --- |
| ``` public: int LocateFabricationConnector( 	String^ group,  	String^ name,  	ConnectorDomainType domain,  	ConnectorProfileType shape ) ``` |

#### Parameters

group
:   Type:  System String
     The fabrication connector group.

name
:   Type:  System String
     The fabrication connector name.

domain
:   Type:  Autodesk.Revit.DB ConnectorDomainType
     ConnectorDomainType to filter by. Pass ConnectorDomainType::Undefined to get all connector domains.

shape
:   Type:  Autodesk.Revit.DB ConnectorProfileType
     ConnectorProfileType to filter by. Pass ConnectorProfileType::Invalid to get all shapes.

#### Return Value

Return the fabrication connector identifier. Returns -1 if not found.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

# See Also

FabricationConfiguration Class

Autodesk.Revit.DB Namespace

#### IsValidObject Property

---

|  |
| --- |
| StairsComponentConnection Class   See Also |

Specifies whether the .NET object represents a valid Revit entity.

**Namespace:**   Autodesk.Revit.DB.Architecture
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public bool IsValidObject { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property IsValidObject As Boolean 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property bool IsValidObject { 	bool get (); } ``` |

#### Return Value

True if the API object holds a valid Revit native object, false otherwise.

# Remarks

If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone, a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.

# See Also

StairsComponentConnection Class

Autodesk.Revit.DB.Architecture Namespace

#### Operation Property

---

|  |
| --- |
| DocumentChangedEventArgs Class   See Also |

The operation associated with this event

**Namespace:**   Autodesk.Revit.DB.Events
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public UndoOperation Operation { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property Operation As UndoOperation 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property UndoOperation Operation { 	UndoOperation get (); } ``` |

# See Also

DocumentChangedEventArgs Class

Autodesk.Revit.DB.Events Namespace

#### Export Method (String, String, ViewSet, FBXExportOptions)

---

|  |
| --- |
| Document Class   See Also |

Exports the document in 3D-Studio Max (FBX) format.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public bool Export( 	string folder, 	string name, 	ViewSet views, 	FBXExportOptions options ) ``` |

| Visual Basic |
| --- |
| ``` Public Function Export ( _ 	folder As String, _ 	name As String, _ 	views As ViewSet, _ 	options As FBXExportOptions _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: bool Export( 	String^ folder,  	String^ name,  	ViewSet^ views,  	FBXExportOptions^ options ) ``` |

#### Parameters

folder
:   Type:  System String
     Output folder, into which file(s) will be exported. The folder must exist.

name
:   Type:  System String
     Either the name of a single file or a prefix for a set of files. If    a null reference (  Nothing  in Visual Basic)  or empty, automatic naming will be used.

views
:   Type:  Autodesk.Revit.DB ViewSet
     Selection of views to be exported.Only 3D views are allowed.

options
:   Type:  Autodesk.Revit.DB FBXExportOptions
     Options applicable to the FBX format.

#### Return Value

Function returns true only if all specified views are exported successfully. The function returns False if exporting of any view fails, even if some views might have been exported successfully.

# Remarks

Though the 'options' argument is not currently used, an object still must be provided (may be    a null reference (  Nothing  in Visual Basic)  ).

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | Thrown when the input views is    a null reference (  Nothing  in Visual Basic) |
| Autodesk.Revit.Exceptions ArgumentException | Thrown when the input views is an empty ViewSet. Thrown if any view in the views is not a 3D view. |

# See Also

Document Class

Export Overload

Autodesk.Revit.DB Namespace

#### CanBeCutWithVoid Method

---

|  |
| --- |
| InstanceVoidCutUtils Class   See Also |

Indicates if the element can be cut by an instance with unattached voids.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public static bool CanBeCutWithVoid( 	Element element ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function CanBeCutWithVoid ( _ 	element As Element _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: static bool CanBeCutWithVoid( 	Element^ element ) ``` |

#### Parameters

element
:   Type:  Autodesk.Revit.DB Element
     The element to be cut

#### Return Value

Returns true if the element can be cut by an instance with unattached voids.

# Remarks

Elements in a project can be cut if they are host elements or family instances with a category Generic Model or one of the structural categories.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

InstanceVoidCutUtils Class

Autodesk.Revit.DB Namespace

#### ScaledArea Property

---

|  |
| --- |
| IFCExtrusionCreationData Class   See Also |

The area of the extrusion, scaled to the units of export.

**Namespace:**   Autodesk.Revit.DB.IFC
  **Assembly:**   RevitAPIIFC  (in RevitAPIIFC.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public double ScaledArea { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property ScaledArea As Double 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property double ScaledArea { 	double get (); 	void set (double value); } ``` |

#### Field Value

The value will be 0.0 if the area has never been set on this object.

# See Also

IFCExtrusionCreationData Class

Autodesk.Revit.DB.IFC Namespace

#### GetIndexStreamTriangle Method

---

|  |
| --- |
| IndexBuffer Class   See Also |

Gets a stream that can be used to write  IndexTriangle  primitives into the buffer.

**Namespace:**   Autodesk.Revit.DB.DirectContext3D
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 19.0.0.0 (19.0.0.405)
  **Since:**  2017

# Syntax

| C# |
| --- |
| ``` public IndexStreamTriangle GetIndexStreamTriangle() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetIndexStreamTriangle As IndexStreamTriangle ``` |

| Visual C++ |
| --- |
| ``` public: IndexStreamTriangle^ GetIndexStreamTriangle() ``` |

#### Return Value

The stream that can be used to write into this buffer.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions InvalidOperationException | Thrown if the buffer is not mapped. -or- Thrown if the buffer has insufficient space. |

# See Also

IndexBuffer Class

Autodesk.Revit.DB.DirectContext3D Namespace

#### InvalidSpareLoad Property

---

|  |
| --- |
| BuiltInFailures ElectricityFailures Class   See Also |

The spare/space assigned to panel '[Panel Name]' has an invalid load property. To correct this issue, remove and add the spare/space to the panel again.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId InvalidSpareLoad { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property InvalidSpareLoad As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ InvalidSpareLoad { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures ElectricityFailures Class

Autodesk.Revit.DB Namespace

#### PrimaryHandRailPosition Property

---

|  |
| --- |
| RailingType Class   See Also |

The position of the primary handrail.

**Namespace:**   Autodesk.Revit.DB.Architecture
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public HandRailPosition PrimaryHandRailPosition { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property PrimaryHandRailPosition As HandRailPosition 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property HandRailPosition PrimaryHandRailPosition { 	HandRailPosition get (); 	void set (HandRailPosition value); } ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |
| Autodesk.Revit.Exceptions InvalidOperationException | When setting this property: The rail has no primary hand rail. |

# See Also

RailingType Class

Autodesk.Revit.DB.Architecture Namespace

#### DockableFrameVisibilityChanged Event

---

|  |
| --- |
| UIControlledApplication Class   See Also |

Subscribe to this event to be notified when a Revit GenericDockableFrame has been shown or hidden in the Revit user interface. This event is called only for API-created GenericDockableFrames.

**Namespace:**   Autodesk.Revit.UI
  **Assembly:**   RevitAPIUI  (in RevitAPIUI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2015

# Syntax

| C# |
| --- |
| ``` public event EventHandler<DockableFrameVisibilityChangedEventArgs> DockableFrameVisibilityChanged ``` |

| Visual Basic |
| --- |
| ``` Public Event DockableFrameVisibilityChanged As EventHandler(Of DockableFrameVisibilityChangedEventArgs) ``` |

| Visual C++ |
| --- |
| ``` public:  event EventHandler<DockableFrameVisibilityChangedEventArgs^>^ DockableFrameVisibilityChanged { 	void add (EventHandler<DockableFrameVisibilityChangedEventArgs^>^ value); 	void remove (EventHandler<DockableFrameVisibilityChangedEventArgs^>^ value); } ``` |

# Remarks

This event is raised when the GenericDockableFrame is just about to be shown or hidden.

Event is not cancellable. The 'Cancellable' property of event's argument is always False.

No document may be modified at the time of the event.

The following API functions are not available for the current document during this event:

* All overloads of Autodesk.Revit.DB.Document.Export()
* All overloads of Autodesk.Revit.DB.Document.Import()
* Autodesk::Revit::DB::Document::Print
* Print  and similar overloads.
* SubmitPrint  and similar overloads.
* Close  and similar overloads.
* Save  and similar overloads.
* SaveAs(String)  and similar overloads.

Exception  InvalidOperationException  will be thrown if any of the above methods is called during this event.

# See Also

UIControlledApplication Class

Autodesk.Revit.UI Namespace